# DS 2002 Midterm

**This file should be executed within the DS 2002 Azure class virtual computer**

## Deliverable 1: Design a dimensional data mart that represents a simple business process of your choosing.
   ### a. 
   Retail sales
   ### b. 
   Sakila MySQL database - Business process is sales at a movie rental store
   
## Deliverable 2: Develop an ETL pipeline that extracts, transforms and loads data into your data mart.
   ### a. Extract data from one or more SQL database tables; hosted locally or in the Cloud.
   ### b. Retrieve a data file, either from a remote or local file system, converting its original format (e.g., CSV, JSON) into a SQL database table.
   ### c. Modify the number of columns from each source to the destination.
   ### d. Provide error messages wherever an operation fails (i.e., Try/Except error handlers).
   ### *Extracting the customers and staff and date tables from MySQL workbench relational database (on the local virtual computer)*

#### Importing Libraries
Before importing, make sure these are on your machine. If they aren't, open a terminal and install them.

In [1]:
import os
import pymysql
import mysql.connector
import json
import numpy
import datetime
#import pprint
import requests
import requests.exceptions
import pandas as pd
import pymongo
from sqlalchemy import create_engine

#### Declaring and assigning connection variables to use with MySQL server and the Sakila database

In [2]:
host_name = "localhost"
port = "3306"
user_id = "root"
pwd = "Passw0rd123"

src_dbname = "sakila" # source database to grabbing info from
dst_dbname = "sakila_dw2" # data mart I am creating

#### Defining functions for getting data from a database and setting data into a database

In [3]:
# this fn connects to MySQL database to get data from it and creates a dataframe
def get_dataframe(user_id, pwd, host_name, db_name, sql_query):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}" # the at sign means we cannot put an @ in our password to the connection
    sqlEngine = create_engine(conn_str, pool_recycle=3600) # pool recycle quits command if it takes too long
    connection = sqlEngine.connect() #this returns an instance of a connection to the MySQL server
    dframe = pd.read_sql(sql_query, connection); #this uses Pandas to make a dataframe using sql query
    connection.close() # close connection to conserve resources
    
    return dframe

# this fn creates a new table in MySQL using the Pandas dataframe we created using the get_dataframe fn
def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    if db_operation == "insert": # to insert new table
        df.to_sql(table_name, con=connection, index=False, if_exists='replace') # if_exists=replace will drop the table if it already exists
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update": # to update an old table
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

#### Creating the new data warehouse database and using it to switch the connection context

In [4]:
# creates connection to MySQL
conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}"
sqlEngine = create_engine(conn_str, pool_recycle=3600)

# this empties the database if it exists, creates a fresh one, and then sets following code to use the new database
sqlEngine.execute(f"DROP DATABASE IF EXISTS `{dst_dbname}`;")
sqlEngine.execute(f"CREATE DATABASE `{dst_dbname}`;")
sqlEngine.execute(f"USE {dst_dbname};")

**Must now run the "dim_date_sakila.sql" script in MySQL workbench. The file is located in the project folder.**

### EXTRACT
#### Extracting data (customers, staff, and date dimension table) from the source database tables

In [5]:
try:
    sql_customers = "SELECT * FROM sakila.customer;"
    df_customers = get_dataframe(user_id, pwd, host_name, src_dbname, sql_customers) # makes dataframe for the sakila customers
    display(df_customers.head(2)) # check if it worked
    
except:
    print("Error: cannot extract data")

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [6]:
try:
    sql_staff = "SELECT * FROM sakila.staff;"
    df_staff = get_dataframe(user_id, pwd, host_name, src_dbname, sql_staff) # makes dataframe for sakila staff
    display(df_staff.head(2))
    
except:
    print("Error: cannot extract data")

,staff_id,first_name,last_name,address_id,picture,email,store_id,active,username,password,last_update
0,1,Mike,Hillyer,3,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...,Mike.Hillyer@sakilastaff.com,1,1,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-02-15 03:57:16
1,2,Jon,Stephens,4,None,Jon.Stephens@sakilastaff.com,2,1,Jon,None,2006-02-15 03:57:16

In [7]:
try:
    sql_dates = "SELECT * FROM sakila.dim_date;"
    df_dates = get_dataframe(user_id, pwd, host_name, src_dbname, sql_dates) # makes dataframe for sakila date dimension that was created within MySQL workbench
    display(df_dates.head(2))
    
except:
    print("Error: cannot extract data")

,date_key,full_date,date_name,date_name_us,date_name_eu,day_of_week,day_name_of_week,day_of_month,day_of_year,weekday_weekend,...,is_last_day_of_month,calendar_quarter,calendar_year,calendar_year_month,calendar_year_qtr,fiscal_month_of_year,fiscal_quarter,fiscal_year,fiscal_year_month,fiscal_year_qtr
0,20010101,2001-01-01,2001/01/01,01/01/2001,01/01/2001,2,Monday,1,1,Weekday,...,N,1,2001,2001-01,2001Q1,7,3,2001,2001-07,2001Q3
1,20010102,2001-01-02,2001/01/02,01/02/2001,02/01/2001,3,Tuesday,2,2,Weekday,...,N,1,2001,2001-01,2001Q1,7,3,2001,2001-07,2001Q3

### TRANSFORM
#### Transforming data to drop unnecessary columns and rename the primary key

In [8]:
try:
    drop_cols = ['create_date','last_update'] # this list has the cols we have deemed unnecessary and want to drop
    df_customers.drop(drop_cols, axis=1, inplace=True) # this drops the cols in the drop_cols list we made above from the df_customers dataframe. Axis=0 (is rows) and axis=1 (is cols). Inplace=TRUE makes modification to df directly instead of making a copy of it.
    df_customers.rename(columns={"customer_id":"customer_key"}, inplace=True) # renames columns called id as customer_key
    
    display(df_customers.head(2))
    
except:
    print("Error: cannot transform data")

,customer_key,store_id,first_name,last_name,email,address_id,active
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1

In [9]:
try:
    drop_cols = ['picture','last_update']
    df_staff.drop(drop_cols, axis=1, inplace=True)
    df_staff.rename(columns={"staff_id":"staff_key"}, inplace=True)

    display(df_staff.head(2))
    
except:
    print("Error: cannot transform data")

,staff_key,first_name,last_name,address_id,email,store_id,active,username,password
0,1,Mike,Hillyer,3,Mike.Hillyer@sakilastaff.com,1,1,Mike,8cb2237d0679ca88db6464eac60da96345513964
1,2,Jon,Stephens,4,Jon.Stephens@sakilastaff.com,2,1,Jon,None

### LOAD
#### Loading the transformed dataframes into the new data warehouse by creating new tables

In [10]:
try:
    db_operation = "insert"

    # tables is a list containing vectors that act as a row that creates a table for each dataframe we made (see above description)
    tables = [('dim_customers', df_customers, 'customer_key'), # third argument sets the primary key for the table
              ('dim_staff', df_staff, 'staff_key'),
              ('dim_date', df_dates, 'date_key')]

    for table_name, dataframe, primary_key in tables:
        set_dataframe(user_id, pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)

except:
    print("Error: unable to load data")

Validating successful ETL

In [11]:
conn = pymysql.connect(host=host_name, user=user_id, password=pwd, database=dst_dbname)
cursor = conn.cursor()

try:
    cursor.execute('SELECT * FROM dim_customers;')
    
    for row in cursor.fetchmany(size=5):
        print(row)
        
    cursor.close()
    
except:
    print ("Error: unable to fetch data")
    
conn.close()

(1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', 5, 1)
(2, 1, 'PATRICIA', 'JOHNSON', 'PATRICIA.JOHNSON@sakilacustomer.org', 6, 1)
(3, 1, 'LINDA', 'WILLIAMS', 'LINDA.WILLIAMS@sakilacustomer.org', 7, 1)
(4, 2, 'BARBARA', 'JONES', 'BARBARA.JONES@sakilacustomer.org', 8, 1)
(5, 1, 'ELIZABETH', 'BROWN', 'ELIZABETH.BROWN@sakilacustomer.org', 9, 1)

In [12]:
conn = pymysql.connect(host=host_name, user=user_id, password=pwd, database=dst_dbname)
cursor = conn.cursor()

try:
    cursor.execute('SELECT * FROM dim_staff;')
    
    for row in cursor.fetchmany(size=2):
        print(row)
        
    cursor.close()
    
except:
    print ("Error: unable to fetch data")
    
conn.close()

(1, 'Mike', 'Hillyer', 3, 'Mike.Hillyer@sakilastaff.com', 1, 1, 'Mike', '8cb2237d0679ca88db6464eac60da96345513964')
(2, 'Jon', 'Stephens', 4, 'Jon.Stephens@sakilastaff.com', 2, 1, 'Jon', None)

In [13]:
conn = pymysql.connect(host=host_name, user=user_id, password=pwd, database=dst_dbname)
cursor = conn.cursor()

try:
    cursor.execute('SELECT * FROM dim_date;')
    
    for row in cursor.fetchmany(size=5):
        print(row)
        
    cursor.close()
    
except:
    print ("Error: unable to fetch data")
    
conn.close()

(20010101, datetime.date(2001, 1, 1), '2001/01/01', '01/01/2001', '01/01/2001', 2, 'Monday', 1, 1, 'Weekday', 1, 'January', 1, 'N', 1, 2001, '2001-01', '2001Q1', 7, 3, 2001, '2001-07', '2001Q3')
(20010102, datetime.date(2001, 1, 2), '2001/01/02', '01/02/2001', '02/01/2001', 3, 'Tuesday', 2, 2, 'Weekday', 1, 'January', 1, 'N', 1, 2001, '2001-01', '2001Q1', 7, 3, 2001, '2001-07', '2001Q3')
(20010103, datetime.date(2001, 1, 3), '2001/01/03', '01/03/2001', '03/01/2001', 4, 'Wednesday', 3, 3, 'Weekday', 1, 'January', 1, 'N', 1, 2001, '2001-01', '2001Q1', 7, 3, 2001, '2001-07', '2001Q3')
(20010104, datetime.date(2001, 1, 4), '2001/01/04', '01/04/2001', '04/01/2001', 5, 'Thursday', 4, 4, 'Weekday', 1, 'January', 1, 'N', 1, 2001, '2001-01', '2001Q1', 7, 3, 2001, '2001-07', '2001Q3')
(20010105, datetime.date(2001, 1, 5), '2001/01/05', '01/05/2001', '05/01/2001', 6, 'Friday', 5, 5, 'Weekday', 1, 'January', 1, 'N', 1, 2001, '2001-01', '2001Q1', 7, 3, 2001, '2001-07', '2001Q3')

   ### *Extracting the store and inventory tables from MongoDB NoSQL database (from JSON files located in the data folder in Jupyter and using my Atlas account)*

#### Delcaring and assigning connection varables for the MongoDB server, MySQL server, and the databases

In [14]:
mysql_uid = "root"
mysql_pwd = "Passw0rd123"
#mysql_host = "ds2002-mysql.mysql.database.azure.com"

atlas_cluster_name = "sandbox.den9rfu"
atlas_user_name = "ecm8yu"
atlas_password = "HR91sK8EWrAUzWRM"

conn_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net"
}

src_dbname = "sakila_renting"
dst_dbname = "sakila_dw2"

print(f"Local Connection String: {conn_str['local']}")
print(f"Atlas Connection String: {conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://ecm8yu:HR91sK8EWrAUzWRM@sandbox.den9rfu.mongodb.net

#### Defining functions for getting data from databases and putting data into databases

In [15]:
def get_sql_dataframe(user_id, pwd, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def set_dataframe(user_id, pwd, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

#### Setting up NoSQL environment - Populating MongoDB with source data

In [16]:
client = pymongo.MongoClient(conn_str["atlas"])
db = client[src_dbname]

# Gets the path of the Current Working Directory for this Notebook, and then Appends the 'data' directory.
data_dir = os.path.join(os.getcwd(), 'data')

json_files = {"inventory" : 'sakila_inventory.json',
              "stores" : 'sakila_store.json',
              "films" : 'sakila_film.json'
             }

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile) #turns JSON string file into an object
        file = db[file]
        result = file.insert_many(json_object)
        #print(f"{file} was successfully loaded.")

        
client.close()

### EXTRACT
#### Extracting data from the source MongoDB collections into dataframes

In [17]:
try:
    query = {}
    collection = "inventory"
    df_inventory = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)
    
    display(df_inventory.head(2))
    
except:
    print("Error: cannot extract data")

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17

In [18]:
try:
    query = {}
    collection = "stores"

    df_stores = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)
    display(df_stores.head(2))
    
except:
    print("Error: cannot extract data")

   store_id  manager_staff_id  address_id          last_update
0         1                 1           1  2006-02-15 04:57:12
1         2                 2           2  2006-02-15 04:57:12

In [19]:
try:
    query = {}
    collection = "films"

    df_films = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)
    display(df_films.head(2))
    
except:
    print("Error: cannot extract data")

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42

### TRANSFORM
#### Making necessary transformations

In [20]:
try:
    drop_cols = ['last_update']
    df_inventory.drop(drop_cols, axis=1, inplace=True)
    df_inventory.rename(columns={"inventory_id":"inventory_key"}, inplace=True)
    display(df_inventory.head(2))
    
except:
    print("Error: cannot transform data")

   inventory_key  film_id  store_id
0              1        1         1
1              2        1         1

In [21]:
try:
    drop_cols = ['last_update']
    df_stores.drop(drop_cols, axis=1, inplace=True)
    df_stores.rename(columns={"store_id":"store_key"}, inplace=True)
    display(df_stores.head(2))
    
except:
    print("Error: cannot transform data")

   store_key  manager_staff_id  address_id
0          1                 1           1
1          2                 2           2

In [22]:
try:
    drop_cols = ['last_update']
    df_films.drop(drop_cols, axis=1, inplace=True)
    df_films.rename(columns={"film_id":"film_key"}, inplace=True)
    display(df_films.head(2))
    
except:
    print("Error: cannot transform data")

,film_key,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"

### LOAD
#### Loading the transformed dataframes into the new data warehouse by creating new tables

In [23]:
try:
    dataframe = df_inventory
    table_name = 'dim_inventory'
    primary_key = 'inventory_key'
    db_operation = "insert"

    set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

except:
    print("Error: unable to load data")

In [24]:
try:
    dataframe = df_stores
    table_name = 'dim_stores'
    primary_key = 'store_key'
    db_operation = "insert"

    set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

except:
    print("Error: unable to load data")

In [25]:
try:
    dataframe = df_films
    table_name = 'dim_films'
    primary_key = 'film_key'
    db_operation = "insert"

    set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

except:
    print("Error: unable to load data")

#### Validating the store and inventory dimension tables were created

In [26]:
try:
    sql_inventory = "SELECT * FROM sakila_dw2.dim_inventory;"
    df_dim_inventory = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_inventory)
    display(df_dim_inventory.head(2))

except:
    print ("Error: unable to fetch data")

   inventory_key  film_id  store_id
0              1        1         1
1              2        1         1

In [27]:
try:
    sql_stores = "SELECT * FROM sakila_dw2.dim_stores;"
    df_dim_stores = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_stores)
    display(df_dim_stores.head(2))

except:
    print ("Error: unable to fetch data")

   store_key  manager_staff_id  address_id
0          1                 1           1
1          2                 2           2

In [28]:
try:
    sql_films = "SELECT * FROM sakila_dw2.dim_films;"
    df_dim_films = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_films)
    df_dim_films.drop(["originial_language_id"])
    display(df_dim_films.head(2))

except:
    print ("Error: unable to fetch data")

Error: unable to fetch data

   ### *Extacting the payment and rental tables from local file system (file is contained in zip of my Midterm repo)*

### EXTRACT
#### Extracting data from JSON file

In [29]:
try:
    data_dir = os.path.join(os.getcwd(), 'data')
    data_file = os.path.join(data_dir, 'sakila_rental.csv')

    df_rentals = pd.read_csv(data_file, sep=';', header=0, index_col=None)
    display(df_rentals.head())
    
except:
    print("Error: cannot extract data")

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [30]:
try:
    data_dir = os.path.join(os.getcwd(), 'data')
    data_file = os.path.join(data_dir, 'sakila_payment.csv')

    df_payments = pd.read_csv(data_file, sep=';', header=0, index_col=None)
    display(df_payments.head())
    
except:
    print("Error: cannot extract data")

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30
2,3,1,1,1185,5.99,2005-06-15 00:54:12,2006-02-15 22:12:30
3,4,1,2,1422,0.99,2005-06-15 18:02:53,2006-02-15 22:12:30
4,5,1,2,1476,9.99,2005-06-15 21:08:46,2006-02-15 22:12:30

### TRANSFORM
#### Transforming to remove unnecessary columns

In [31]:
try:
    drop_cols = ['last_update']
    df_rentals.drop(drop_cols, axis=1, inplace=True)
    df_rentals.rename(columns={"rental_id":"rental_key"}, inplace=True)

    display(df_rentals.head(2))
    
except:
    print("Error: cannot transform data")

,rental_key,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1

In [32]:
try:
    drop_cols = ['last_update']
    df_payments.drop(drop_cols, axis=1, inplace=True)
    df_payments.rename(columns={"payment_id":"payment_key"}, inplace=True)

    display(df_payments.head(2))
    
except:
    print("Error: cannot transform data")

   payment_key  customer_id  staff_id  rental_id  amount         payment_date
0            1            1         1         76    2.99  2005-05-25 11:30:37
1            2            1         1        573    0.99  2005-05-28 10:35:23

### LOAD
#### Loading data into MySQL using the previously used set_dataframe function

In [33]:
try:
    dataframe = df_rentals
    table_name = 'dim_rentals'
    primary_key = 'rental_key'
    db_operation = "insert"

    set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)
    
except:
    print("Error: unable to load data")

In [34]:
try:
    dataframe = df_payments
    table_name = 'dim_payments'
    primary_key = 'payment_key'
    db_operation = "insert"

    set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)
    
except:
    print("Error: unable to load data")

#### Validating the rental and payment dimension tables were created

In [35]:
try:
    sql_rentals = "SELECT * FROM sakila_dw2.dim_rentals;"
    df_dim_rentals = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_rentals)
    display(df_dim_rentals.head(2))
    
except:
    print ("Error: unable to fetch data")

,rental_key,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1

In [36]:
try:
    sql_payments = "SELECT * FROM sakila_dw2.dim_payments;"
    df_dim_payments = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_payments)
    display(df_dim_payments.head(2))

except:
    print ("Error: unable to fetch data")

   payment_key  customer_id  staff_id  rental_id  amount         payment_date
0            1            1         1         76    2.99  2005-05-25 11:30:37
1            2            1         1        573    0.99  2005-05-28 10:35:23

### *Fact table modeling the business process*

### Crafting table using Pandas DataFrames
#### Retrieving and merging data from rentals and inventory

In [37]:
try:
    # retrieving data from inventory table
    sql_inventory = "SELECT * FROM sakila_dw2.dim_inventory;"
    df_inventory = get_dataframe(user_id, pwd, host_name, dst_dbname, sql_inventory)
    df_inventory.rename(columns={"inventory_key":"inventory_id"}, inplace=True) # renaming the inventory key to join it to the rentals table

    # renaming the rental key to rental id so it can be joined with the payment table
    sql_rentals = "SELECT * FROM sakila_dw2.dim_rentals;"
    df_rentals = get_dataframe(user_id, pwd, host_name, dst_dbname, sql_rentals)

    # joining the inventory table to the rental table
    df_rentals = pd.merge(df_rentals, df_inventory, on='inventory_id', how='inner')
    df_rentals.drop(['inventory_id'], axis=1, inplace=True)

    display(df_rentals.head(2))
    
except:
    print("Error: unable to make table")

,rental_key,rental_date,customer_id,return_date,staff_id,film_id,store_id
0,1,2005-05-24 22:53:30,130,2005-05-26 22:04:30,1,80,1
1,1577,2005-06-16 04:03:28,327,2005-06-24 22:40:28,2,80,1

#### Retrieving payment table and joining it with the rentals to create the fact table

In [38]:
try:
    # retrieving data from payments table
    sql_payments = "SELECT * FROM sakila_dw2.dim_payments;"
    df_payments = get_dataframe(user_id, pwd, host_name, dst_dbname, sql_payments)
    df_payments.drop(['customer_id', 'staff_id'], axis=1, inplace=True) # droping these columns because they already exist in the rentals dataframe and would make duplicates

    # renaming the rental key to rental id so it can be joined with the payment table
    df_rentals.rename(columns={"rental_key":"rental_id"}, inplace=True)

    # joining the payment table to the rental table
    df_fact_orders = pd.merge(df_payments, df_rentals, on='rental_id', how='inner')
    df_fact_orders.drop(['payment_key'], axis=1, inplace=True)

    # reordering columns to make most sense
    ordered_cols = ['rental_id','store_id','film_id','customer_id','staff_id','rental_date','return_date','amount','payment_date']
    df_fact_orders = df_fact_orders[ordered_cols]

    # making a new column to act as the primary key
    df_fact_orders.insert(0, "order_key", range(1, df_fact_orders.shape[0]+1))

    display(df_fact_orders.head(2))
    
except:
    print("Error: unable to make table")

,order_key,rental_id,store_id,film_id,customer_id,staff_id,rental_date,return_date,amount,payment_date
0,1,76,2,663,1,2,2005-05-25 11:30:37,2005-06-03 12:00:37,2.99,2005-05-25 11:30:37
1,2,573,2,875,1,1,2005-05-28 10:35:23,2005-06-03 06:32:23,0.99,2005-05-28 10:35:23

Sending the fact table to the sakila_dw2 database

In [39]:
try:
    table_name = "fact_orders"
    primary_key = "order_key"
    db_operation = "insert"
    set_dataframe(user_id, pwd, dst_dbname, df_fact_orders, table_name, primary_key, db_operation)
    
except:
    print("Error: unable to write dataframe to database")

## Deliverable 3: Author one or more SQL queries (SELECT statements) to demonstrate proper functionality
   ### a. SELECT data from at least 3 tables (two dimensions; plus the fact table).
   ### b. Perform some type of aggregation (e.g., SUM, COUNT, AVERAGE). This, of course, necessitates some form of grouping operation (e.g., GROUP BY <customer.last_name>).

In [40]:
# return the customers who rent the most movies and the amount they have spent as well as the duration of rental time
   # concat function source: https://www.mssqltips.com/sqlservertip/2985/concatenate-sql-server-columns-into-a-string-with-concat/
query= """
    SELECT CONCAT(customers.last_name, ', ',customers.first_name) AS 'customer_name',
        COUNT(orders.order_key) AS 'total_orders',
        SUM(orders.amount) AS 'total_spent ($)',
        SUM(films.rental_duration) AS 'total_rentals_duration ()'
    FROM {0}.fact_orders AS orders 
    INNER JOIN {0}.dim_customers AS customers
    ON customers.customer_key = orders.customer_id
    INNER JOIN {0}.dim_films AS films
    ON films.film_key = orders.film_id
    GROUP BY customer_name
    ORDER BY total_orders DESC;
""".format(dst_dbname)

df_test = get_dataframe(user_id, pwd, host_name, dst_dbname, query)
df_test.head(5)

    customer_name  total_orders  total_spent ($)  total_rentals_duration ()
0   HUNT, ELEANOR            46           216.54                      223.0
1      SEAL, KARL            45           221.55                      219.0
2     SHAW, CLARA            42           195.58                      209.0
3    DEAN, MARCIA            42           175.58                      205.0
4  SANDERS, TAMMY            41           155.59                      202.0